/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strlen.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: eidaho <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/29 12:10:40 by eidaho            #+#    #+#             */
/*   Updated: 2020/01/29 13:59:10 by eidaho           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

int		ft_strlen(char *str)
{
	int i;

	i = 0;
	while (str[i] != '\0')
		i++;
	return (i);
}

#include <stdio.h>

int		main(void)
{
	char str[] = "Mama loves you";
	printf("%d", ft_strlen(str));
	return (0);
}

// оригинальная программа пишется без функции int main
